# Work Week 13 Discussion Post
This week we will examine the "benefit x.csv" for retirees.<br>
First, we run the code cell below.

In [148]:
# Run this cell to set up the notebook, but please don't change it.

# These lines import the Numpy and Datascience modules.
import numpy as np
from datascience import *

# These lines do some fancy plotting magic.
import matplotlib
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter('ignore', FutureWarning)

In [164]:
retirees = Table.read_table('Retirees.csv')
retirees

EEID | First Name | Last Name | Gender | DOB        | DOH        | DOR        | Salary1 | Salary2 | Salary3 | Benefit | Age at Retirement | Current Age | Age at Hire | Years of Service
61   | KAILYN     | STEWART   | FEMALE | 04-13-1956 | 06-08-2003 | 05-01-2021 | 0       | 0       | 0       | 86648   | 65.0505           | 68.7171     | 47.153      | 17.8975
215  | ALESSANDRA | CARROLL   | FEMALE | 11-21-1952 | 09-06-2010 | 12-01-2017 | 0       | 0       | 0       | 70227   | 65.0285           | 72.1119     | 57.7922     | 7.2363
831  | LEVI       | WEEKS     | MALE   | 11-18-1957 | 01-05-2014 | 12-01-2022 | 0       | 0       | 0       | 49287   | 65.0368           | 67.1201     | 56.1311     | 8.90571
1139 | ARIANA     | MARSHALL  | FEMALE | 09-12-1958 | 09-09-2026 | 10-01-2023 | 0       | 0       | 0       | 46509   | 65.0532           | 66.3032     | 67.9918     | -2.93858
1293 | ZARIAH     | PADILLA   | FEMALE | 09-05-1959 | 11-12-2007 | 10-01-2024 | 0       | 0       | 0       | 78919   | 65.0724           | 65.3224     | 48.1858     | 16.8865
2833 | DANIELLE   | FREDERICK | FEMALE | 01-22-1959 | 06-08-2017 | 02-01-2024 | 0       | 0       | 0       | 45359   | 65.0258           | 65.9425     | 58.3783     | 6.64749
3449 | JAYSON     | ADKINS    | MALE   | 09-01-1951 | 10-05-2015 | 10-01-2016 | 0       | 0       | 0       | 79188   | 65.0833           | 73.3333     | 64.0943     | 0.989041
4065 | KHLOE      | COOK      | FEMALE | 03-05-1952 | 11-02-1990 | 04-01-2017 | 0       | 0       | 0       | 57437   | 65.0724           | 72.8224     | 38.6584     | 26.4139
5297 | MICHAEL    | SCHULTZ   | MALE   | 10-16-1953 | 08-06-2022 | 11-01-2018 | 0       | 0       | 0       | 63326   | 65.0422           | 71.2089     | 68.8059     | -3.7637
5605 | SAUL       | ROBERSON  | MALE   | 12-07-1952 | 10-01-2014 | 01-01-2017 | 0       | 0       | 0       | 64824   | 64.0669           | 72.0669     | 61.8169     | 2.25
... (96 rows omitted)

In [165]:
# Adjust the years of service
def adjust_yos(yos):
    if yos < 5:
        return 5
    else:
        return yos

In [166]:
year_adjust = retirees.apply(adjust_yos, 'Years of Service')

In [167]:
retirees = retirees.with_column('Years of Service', year_adjust)

In [168]:
def group(age):
    if age < 68:
        return '65 - 67'
    elif age < 71:
        return '68 - 70'
    elif age < 74:
        return '71 - 73'
    elif age < 76:
        return '74 - 75'
    else:
        return '76+'

In [169]:
age_group = retirees.apply(group, 'Current Age')
retirees = retirees.with_column('Age Group', age_group)

In [162]:
# group benefits by age
retirees.select('Age Group', 'Years of Service').group('Age Group', np.average)

Age Group | Years of Service average
65 - 67   | 9.16014
68 - 70   | 8.83041
71 - 73   | 8.00797
74 - 75   | 8.12473

In [170]:
# group benefits by age
retirees.select('Age Group').group('Age Group')

Age Group | count
65 - 67   | 38
68 - 70   | 23
71 - 73   | 39
74 - 75   | 6